package com.example.myapplication.Enum;

import java.util.Arrays;

import lombok.AllArgsConstructor;
import lombok.Getter;
import lombok.NoArgsConstructor;

@AllArgsConstructor
@NoArgsConstructor
@Getter
public enum QuestionType {
    BUNBUN(       0,15, -10,-10,-10,-10,-10,-10,-10,-10,-10, "ぶんぶんしますか？"),
    EMOTION_LESS( 1,-10, 15,-10,-10,-10,-10,-10,-10,-10,-10, "感情を失いましたか？"),
    FUTURE_HOPE(  2,-10, -10,15,-10,-10,-10,-10,-10,-10,-10, "将来を期待されていますか?"),
    BLACK_POOP(   3,-10, -10,-10,15,-10,-10,-10,-10,-10,-10, "ウンコが黒いですか?"),
    ECSTASY(      4,-10, -10,-10,-10,15,-10,-10,-10,-10,-10, "昇天してる？"),
    CLANNAD_LIFE( 5,-10, -10,-10,-10,-10,15,-10,-10,-10,-10, "クラナドは人生?"),
    OHTANI(       6,-10, -10,-10,-10,-10,-10,15,-10,-10,-10, "球速165km/sを投げますか?"),
    WOMAN_GORORI( 7,-10, -10,-10,-10,-10,-10,-10,15,-10,-10, "女性ですか？"),
    MOKOU(        8,-10, -10,-10, -10,-10,-10,-10,-10,15,-10,"勇気の切断"),
    GORORI(       9,-10, -10,-10,-10,-10,-10,-10,-10,-10,15, "教育番組に出ていますか？"),

    // 10-40
    HAISHIN(      10,3, 1,-2,-2, 3, 3, 1,-3, 3,-2,"配信者ですか？"),
    GAMER(        11,1, 0,-2,-2, 1, 3, 0,-3, 5,-2, "ゲーム実況者ですか？"),
    MAN(          12,8, 8, 8, 8, 8, 8, 8,-8, 8, 0, "男性ですか？"),
    TEEN(         13,-6,-6, 0, 8,-6,-6,-6,-6,-6,0, "10代ですか？"),
    THIRTEEN(     14,8, 8,-6,-6,8,8,8,3,5,-6, "30歳以上ですか？"),
    REAL(         15,8, 0,8,8,8,8,-6,8,8,-6, "実在する？"),
    NAME_U(       16,8, 8,8,8,-6,8,-6,-6,8,-6, "名前に「う」がつく？"),
    NAME_N(       17,8, 8,8,8,8,8,8,-6,-6,-6, "名前に「ん」がつく？"),
    NAME_KO(      18,-6, -6,-6,8,8,0,-6,0,8,0, "名前に「こ」がつく？"),
    NAME_O(       19,8, -6,-6,-6,-6,-6,8,-6,-6,-6, "名前に「お」がつく？"),
    NAME_RI(      20,8, -6,-6,-6,-6,-6,-6,8,-6,8, "名前に「り」がつく？"),
    HIRAGANA(     21,0, 0,0,0,0,0,0,-6,8,-6, "名前はすべてひらがな？"),
    KATAKANA(     22,-6, -6,-6,-6,-6,-6,-6,-6,-6,8, "名前はすべてカタカナ？"),
    STUDENT(      23,-6, -6,8,8,-6,-6,-6,-6,-6,0, "学校に通っている？"),
    HOSPITAL(     24,8, 0,-6,-6,8,8,0,-6,-6,-6, "病院勤務経験がある？"),
    WORKER(       25,8, 0,-6,-6,8,8,0,8,8,6, "働いている？"),
    GAME_RELATION(26,-3, -6,-6,-6,-3,8,-6,-6,10,-6, "ゲームに関係する？"),
    YOUTUBER(     27,8, 0,-6,-6,8,5,0,-6,8,-6, "Youtuberですか？"),
    EPHEMERAL(    28,-2, 3,5,3,-2,1,-5,1,-8,0, "儚い存在ですか？"),
    DIRTY(        29,1, -2,-8,0,1,-1,1,1,8,-5, "汚れていますか？"),
    HUMAN(        30,8, 2,8,8,8,8,2,8,3,-8, "人間ですか？"),
    NICONICO(     31,5, 2,-2,-2,5,8,2,-2,8,5, "ニコニコ動画で有名？"),
    ZOO(          32,-6, -6,-6,-6,-6,-6,-6,-6,8,8, "動物？"),
    SMILE(        33,0, -2,2,2,0,-2,2,0,0,0, "笑顔ですか？"),
    JOY(          34,1, -5,3,3,2,-3,0,1,-1,0, "喜怒哀楽の「喜」ですか？"),
    ANGER(        35,-1, -5,-5,-5,-1,-5,0,3,8,0, "喜怒哀楽の「怒」ですか？"),
    SAD(          36,-1, 5,-3,-3,3,8,0,-1,5,0, "喜怒哀楽の「哀」ですか？"),
    FUN(          37,3, -5,5,5,0,1,0,2,5,0, "喜怒哀楽の「楽」ですか？"),
    SPORTS(       38,3, -2,2,5,3,3,8,0,4,0, "運動が得意ですか？"),
    LONG_HAIR(    39,-2, -2,-2,4,-2,-2,-2,8,6,0, "髪が長いですか？"),
    SHORT_HAIR(   40,2, 6,6,-2,2,3,2,-2,-2,0, "髪が短いですか？");


    private int questionNo;
    private int cookingPoint;
    private int emotionLessPoint;
    private int godChildPoint;
    private int highSchoolPoint;
    private int sanFranciscoPoint;
    private int cryPoint;
    private int ohtaniPoint;
    private int womanGororiPoint;
    private int mokouPoint;
    private int gororiPoint;

    private String question;

    /*
    * ・配信者ですか？（ゲーム実況者ですか？）
    * ・男性ですか？
    * ・10代ですか？（30歳以上ですか？）
    * ・実在する？
    * ・名前は全て漢字？▲
    * ・名前に「ん」がつく？（文字=う、ん、こ、お、り）
    * ・ひらがな？カタカナ？
    * ・学校に通っている？
    * ・病院勤務？
    * ・働いている？
    * ・ゲームに関係する？
    * ・Youtuberですか？
    * ・儚い存在ですか？（汚れていますか？）
    * ・人間ですか？
    * ・ニコニコ動画で有名？
    * ・動物？（もこう含む）
    * ・笑顔ですか？
    * ・喜怒哀楽の○ですか？（4パターン）
    * ・運動が得意ですか？
    * ・髪が長いですか？（短いですか？）
    * */

    public static QuestionType toQuestionNo(int questionNo){
        return Arrays.stream(QuestionType.values()).filter(it->it.questionNo == questionNo).findFirst().orElse(null);
    }

}
